Autodesk.Revit.UI.ComboBoxMemberData.GroupName
Gets or sets a group name for the ComboBoxMember.
Remarks: The GroupName is used to group the items and also appears in the group header.
All ComboBoxMembers assigned to the same group will be grouped in the ComboBox. There will be a header that shows the name.
The default value is null.
Since: 2011

Autodesk.Revit.UI.ComboBoxMemberData.Image
The image shown on the ComboBoxMember.
Remarks: The image will be shown on the left side of the item when the item is added to a ComboBox.
The best size is 16 x 16 pixels.
Since: 2011

Autodesk.Revit.UI.ComboBoxMemberData.Text
The user-visible text of the ComboBoxMember.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the value to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the value to an empty string,
or when the value contains invalid characters.
Since: 2011

Autodesk.Revit.UI.ComboBoxMemberData.#ctor(System.String,System.String)
Constructs a new instance of ComboBoxMemberData.
name: The internal name of the ComboBoxMember.
text: The user visible text seen on the item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for one or more arguments.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for one or more arguments.
Since: 2011

Autodesk.Revit.UI.ComboBoxMemberData
This class contains information necessary to construct a ComboBoxMember.
Since: 2011